app/controllers/admins/end_users_controller.rb

SELECT  "end_users".* FROM "end_users" LIMIT ? OFFSET ?  [["LIMIT", 50], ["OFFSET", 0]]
---
	def index
		@end_users = EndUser.all.page(params[:page]).per(PER)

SELECT  "end_users".* FROM "end_users" WHERE "end_users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
	def show
		@end_user = EndUser.find(params[:id])

SELECT  "end_users".* FROM "end_users" WHERE (1) LIMIT ?  [["LIMIT", 1]]
---
	def edit
		@end_user=EndUser.find(params[:end_user_id])

SELECT  "end_users".* FROM "end_users" WHERE (1) LIMIT ?  [["LIMIT", 1]]
DELETE FROM "end_users" WHERE "end_users"."id" = ?  [["id", 1]]
---
	def destroy
		@end_user = EndUser.find_by(params[:id])
		if @end_user.destroy