app/controllers/admins/orders_controller.rb

SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "orders" SET "delivery_status" = ?, "updated_at" = ? WHERE "orders"."id" = ?  [["delivery_status", 2], ["updated_at", "2019-08-26 05:37:40.798264"], ["id", 1]]
---
	def update
		@order = Order.find(params[:id])
		if @order.update(order_params)