app/controllers/admins/sell_cds_controller.rb

DELETE FROM "sell_cds" WHERE "sell_cds"."id" = ?  [["id", 2]]
---
	def destroy
		sell_cd = SellCd.find(params[:id])
		if sell_cd.destroy

INSERT INTO "discs" ("sell_cd_id", "disc", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["sell_cd_id", 2], ["disc", "1"], ["created_at", "2019-08-22 07:48:12.854955"], ["updated_at", "2019-08-22 07:48:12.854955"]]
INSERT INTO "sell_cds" ("label_id", "genre_id", "artist_id", "title", "value", "sell_status", "stock", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
	def main_create
		sell_cd = SellCd.new(sell_cd_params)
		disc_number = 0

		sell_cd.discs_attributes.each do |disc|
			disc_number += 1
			disc.number = disc_number

			song_number = 0

			disc.songs_attributes.each do |song|
				song_number += 1
				song.number = song_number
			end
		end

		if sell_cd.save