app/controllers/admins/sell_cds_controller.rb

	def show
		@sell_cd = SellCd.new
		@sell_cd = SellCd.find(params[:id])
		@discs = @sell_cd.discs.order(number: "ASC")
---
SELECT  "sell_cds".* FROM "sell_cds" WHERE "sell_cds"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
SELECT "discs".* FROM "discs" WHERE "discs"."sell_cd_id" = ? ORDER BY "discs"."number" ASC  [["sell_cd_id", 3]]

	def artist_show
		@artist = Artist.find(params[:id])
		@sell_cds = SellCd.where(artist_id: @artist)
		@kaminari = @sell_cds.page(params[:page]).per(PER)
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
SELECT "sell_cds".* FROM "sell_cds" WHERE "sell_cds"."artist_id" = ?  [["artist_id", 7]]
SELECT COUNT(*) FROM "sell_cds" WHERE "sell_cds"."artist_id" = ?  [["artist_id", 7]]
SELECT  "sell_cds".* FROM "sell_cds" WHERE "sell_cds"."artist_id" = ? LIMIT ?  [["artist_id", 7], ["LIMIT", 11]]

	def genre_show
		@genre = Genre.find(params[:id])
		@sell_cds = SellCd.where(genre_id: @genre)
		@kaminari = @sell_cds.page(params[:page]).per(PER)
---
SELECT  "genres".* FROM "genres" WHERE "genres"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "sell_cds".* FROM "sell_cds" WHERE "sell_cds"."genre_id" = ?  [["genre_id", 2]]
SELECT COUNT(*) FROM "sell_cds" WHERE "sell_cds"."genre_id" = ?  [["genre_id", 2]]
SELECT  "sell_cds".* FROM "sell_cds" WHERE "sell_cds"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

	def label_show
		@label = Label.find(params[:id])
		@sell_cds = SellCd.where(label_id: @label)
		@kaminari = SellCd.page(params[:page]).per(PER)
---
SELECT  "labels".* FROM "labels" WHERE "labels"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "sell_cds".* FROM "sell_cds" WHERE "sell_cds"."label_id" = ?  [["label_id", 1]]
SELECT COUNT(*) FROM "sell_cds"

	def index
		@sell_cds = SellCd.page(params[:page]).per(PER)
---
SELECT  "sell_cds".* FROM "sell_cds" LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]

	def destroy
		sell_cd = SellCd.find(params[:id])
		if sell_cd.destroy
---
SELECT  "sell_cds".* FROM "sell_cds" WHERE "sell_cds"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
DELETE FROM "sell_cds" WHERE "sell_cds"."id" = ?  [["id", 4]]

	def genre_destroy
		genre = Genre.find(params[:id])
		if genre.destroy
---
SELECT  "genres".* FROM "genres" WHERE "genres"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "genres" WHERE "genres"."id" = ?  [["id", 1]]

	def artist_destroy
		artist = Artist.find(params[:id])
		if artist.destroy
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "artists" WHERE "artists"."id" = ?  [["id", 5]]

	def label_destroy
		label = Label.find(params[:id])
		if label.destroy
---
SELECT  "labels".* FROM "labels" WHERE "labels"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "labels" WHERE "labels"."id" = ?  [["id", 6]]

	def artist_create
		@artist = Artist.new(artist_params)
		if @artist.save
---
INSERT INTO "artists" ("artist", "created_at", "updated_at") VALUES (?, ?, ?)  [["artist", "a"], ["created_at", "2019-08-26 10:44:47.081475"], ["updated_at", "2019-08-26 10:44:47.081475"]]

	def genre_create
		@genre = Genre.new(genre_params)
		if @genre.save
---
INSERT INTO "genres" ("created_at", "updated_at", "genre") VALUES (?, ?, ?)  [["created_at", "2019-08-25 06:51:05.172604"], ["updated_at", "2019-08-25 06:51:05.172604"], ["genre", "aaa"]]

	def label_create
		@label = Label.new(label_params)
		if @label.save
---
INSERT INTO "labels" ("created_at", "updated_at", "label") VALUES (?, ?, ?)  [["created_at", "2019-08-26 08:48:37.645093"], ["updated_at", "2019-08-26 08:48:37.645093"], ["label", "aaa"]]

	def artist_edit
		@artist = Artist.find(params[:id])
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]

	def genre_edit
		@genre = Genre.find(params[:id])
---
SELECT  "genres".* FROM "genres" WHERE "genres"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

	def label_edit
		@label = Label.find(params[:id])
---
SELECT  "labels".* FROM "labels" WHERE "labels"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

	def main_edit
		@sell_cd = SellCd.find(params[:id])
---
SELECT  "sell_cds".* FROM "sell_cds" WHERE "sell_cds"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]

	def genre_index
		@genres = Genre.page(params[:page]).per(PER)
---
SELECT  "genres".* FROM "genres" LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]

	def artist_index
		@artists = Artist.page(params[:page]).per(PER)
---
SELECT  "artists".* FROM "artists" LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]

	def label_index
		@labels = Label.page(params[:page]).per(PER)
---
SELECT  "labels".* FROM "labels" LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]

	def artist_update
		@artist = Artist.find(params[:id])
		if @artist.update(artist_params)
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "artists" SET "artist" = ?, "updated_at" = ? WHERE "artists"."id" = ?  [["artist", "change"], ["updated_at", "2019-08-26 10:19:32.749296"], ["id", 7]]

	def genre_update
		@genre = Genre.find(params[:id])
		if @genre.update(genre_params)
---
SELECT  "genres".* FROM "genres" WHERE "genres"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "genres" SET "genre" = ?, "updated_at" = ? WHERE "genres"."id" = ?  [["genre", "Future Souls"], ["updated_at", "2019-08-26 10:36:52.301782"], ["id", 1]]

	def label_update
		@label = Label.find(params[:id])
		if @label.update(label_params)
---
SELECT  "labels".* FROM "labels" WHERE "labels"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "labels" SET "label" = ?, "updated_at" = ? WHERE "labels"."id" = ?  [["label", "IRMA RECORD"], ["updated_at", "2019-08-26 10:59:41.888368"], ["id", 1]]

	def main_update
		@sell_cd = SellCd.find(params[:id])
		if @sell_cd.update(sell_cd_params)
---
SELECT  "sell_cds".* FROM "sell_cds" WHERE "sell_cds"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
UPDATE "sell_cds" SET "image_id" = ?, "updated_at" = ? WHERE "sell_cds"."id" = ?  [["image_id", "9d83a5f315f538185359d25174bad366ea82b9058277e496bfa718e58296"], ["updated_at", "2019-08-26 11:05:04.634411"], ["id", 7]]

	def main_create
		sell_cd = SellCd.new(sell_cd_params)
		disc_number = 0

		if sell_cd.save
---
INSERT INTO "sell_cds" ("label_id", "genre_id", "artist_id", "title", "value", "image_id", "sell_status", "stock", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)