app/views/admins/sell_cds/index.html.erb

			<% sell_cd.cd_artists.each do |name| %>
			<% artist = Artist.find_by(id: name.artist_id) %>
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]