app/views/admins/sell_cds/show.html.erb


      <% @sell_cd.discs.each do |disc| %>
---
SELECT "discs".* FROM "discs" WHERE "discs"."sell_cd_id" = ?  [["sell_cd_id", 1]]

         <p><%= disc.disc %></p>
         <% disc.songs.order(number: "ASC").each do |song| %>
---
SELECT "songs".* FROM "songs" WHERE "songs"."disc_id" = ? ORDER BY "songs"."number" ASC  [["disc_id", 1]]