app/views/orders/confirm.html.erb

SELECT  "sell_cds".* FROM "sell_cds" WHERE "sell_cds"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
        <td colspan="2">ステータス　<%= enum(cart.sellcd.sell_status)  %></td>
        <td colspan="2">価格　<%= cart.sellcd.value %></td>