app/views/sell_cds/show.html.erb

                  <%end%>
                  <%= @sell_cd.favorites.count %> いいね
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."sell_cd_id" = ?  [["sell_cd_id", 1]]

      <p><%= disc.disc %></p>
      <% disc.songs.order(number: "ASC").each do |song| %>
---
SELECT "songs".* FROM "songs" WHERE "songs"."disc_id" = ? ORDER BY "songs"."number" ASC  [["disc_id", 1]]