app/views/sell_cds/show.html.erb

SELECT "songs".* FROM "songs" WHERE "songs"."disc_id" = ? ORDER BY "songs"."number" ASC  [["disc_id", 1]]
---
      <p><%= disc.disc %></p>
      <% disc.songs.order(number: "ASC").each do |song| %>