app/controllers/carts_controller.rb

	def index
		@genres = Genre.all
		@carts = Cart.where(end_user_id: current_end_user.id)
---
SELECT "genres".* FROM "genres"
SELECT "carts".* FROM "carts" WHERE "carts"."end_user_id" = ?  [["end_user_id", 1]]

	def destroy
		cart = Cart.find_by(params[:id])
		cart.destroy
---
SELECT  "carts".* FROM "carts" WHERE (4) LIMIT ?  [["LIMIT", 1]]
DELETE FROM "carts" WHERE "carts"."id" = ?  [["id", 1]]

	def add
		cart = Cart.new(cart_params)
		cart.end_user_id = current_end_user.id
		if cart.save
---
INSERT INTO "carts" ("end_user_id", "sell_cd_id", "quantity", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["end_user_id", 2], ["sell_cd_id", 1], ["quantity", 1], ["created_at", "2019-08-25 11:57:34.756429"], ["updated_at", "2019-08-25 11:57:34.756429"]]