app/controllers/delivery_addresses_controller.rb

SELECT  "end_users".* FROM "end_users" WHERE "end_users"."id" = ? ORDER BY "end_users"."id" ASC LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def update
    @end_user = EndUser.find(params[:id])