app/controllers/delivery_addresses_controller.rb

SELECT  "end_users".* FROM "end_users" WHERE "end_users"."id" = ? ORDER BY "end_users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "delivery_addresses" ("end_user_id", "zip", "delivery_address", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["end_user_id", 3], ["zip", "5470003"], ["delivery_address", "大阪市平野区"], ["created_at", "2019-08-26 06:09:46.261157"], ["updated_at", "2019-08-26 06:09:46.261157"]]
---
  def create
      @end_user=EndUser.find(params[:end_user_id])
      @delivery_address = DeliveryAddress.new(delivery_address_params)
      @delivery_address.end_user_id = params[:end_user_id]
      @delivery_address.save

SELECT  "delivery_addresses".* FROM "delivery_addresses" WHERE (3) LIMIT ?  [["LIMIT", 1]]
UPDATE "delivery_addresses" SET "delivery_address" = ?, "updated_at" = ? WHERE "delivery_addresses"."id" = ?  [["delivery_address", "大阪市"], ["updated_at", "2019-08-26 06:54:55.266954"], ["id", 1]]
---
  def update
    @delivery_address = DeliveryAddress.find_by(params[:id])
    if @delivery_address.update(delivery_address_params)

SELECT  "delivery_addresses".* FROM "delivery_addresses" WHERE "delivery_addresses"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "delivery_addresses" WHERE "delivery_addresses"."id" = ?  [["id", 3]]
---
  def destroy
    @delivery_address = DeliveryAddress.find(params[:id])
    @delivery_address.destroy