app/controllers/end_users_controller.rb

  def show
    @end_user=EndUser.find(params[:id])
    @favs = Favorite.where(end_user_id: params[:id])
    i = 0
    @favsell_cds=Array.new
    @favs.each do |fav|
---
SELECT  "end_users".* FROM "end_users" WHERE "end_users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "favorites".* FROM "favorites" WHERE "favorites"."end_user_id" = ?  [["end_user_id", 1]]

  def leave
    @end_user=EndUser.find(params[:id])
    @end_user.destroy
---
SELECT  "end_users".* FROM "end_users" WHERE "end_users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "end_users" WHERE "end_users"."id" = ?  [["id", 2]]

  def edit
    @end_user=EndUser.find(params[:id])
---
SELECT  "end_users".* FROM "end_users" WHERE "end_users"."id" = ? ORDER BY "end_users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    @end_user=EndUser.find(params[:id])
    @end_user.update(end_user_params)
---
SELECT  "end_users".* FROM "end_users" WHERE "end_users"."id" = ? ORDER BY "end_users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "end_users" SET "kana_first" = ?, "updated_at" = ? WHERE "end_users"."id" = ?  [["kana_first", "ユウシ"], ["updated_at", "2019-08-25 20:10:53.941592"], ["id", 3]]