app/controllers/favorites_controller.rb

	def create
		sell_cd = SellCd.find(params[:sell_cd_id])
		favorite = Favorite.new(sell_cd_id: sell_cd.id)
		favorite.end_user_id = current_end_user.id
		favorite.save
---
SELECT  "sell_cds".* FROM "sell_cds" WHERE "sell_cds"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "favorites" ("end_user_id", "sell_cd_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["end_user_id", 1], ["sell_cd_id", 1], ["created_at", "2019-08-25 11:27:23.241611"], ["updated_at", "2019-08-25 11:27:23.241611"]]

	def destroy
            sell_cd = SellCd.find(params[:sell_cd_id])
            favorite = Favorite.find_by(params[:id])
            favorite.destroy
---
SELECT  "sell_cds".* FROM "sell_cds" WHERE "sell_cds"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "favorites" WHERE "favorites"."id" = ?  [["id", 1]]