app/controllers/orders_controller.rb

  def confirm
    @order = Order.new
    @carts = Cart.where(end_user_id: current_end_user)
    @delivery_address = DeliveryAddress.new
    @end_user=EndUser.find(params[:end_user_id])
---
SELECT "carts".* FROM "carts" WHERE "carts"."end_user_id" = ?  [["end_user_id", 3]]
SELECT  "end_users".* FROM "end_users" WHERE "end_users"."id" = ? ORDER BY "end_users"."id" ASC LIMIT ?  [["id", 3], ["LIMIT", 1]]

  def create
    @order = Order.new(confirm_params)
    @delivery_address=DeliveryAddress.find_by(delivery_address: @order.delivery_address)
    if @delivery_address.nil?
      @d_end_user = EndUser.find(params[:end_user_id])
---
SELECT  "end_users".* FROM "end_users" WHERE "end_users"."id" = ? ORDER BY "end_users"."id" ASC LIMIT ?  [["id", 3], ["LIMIT", 1]]

  def index
    @order = Order.find(current_end_user)
---
SELECT "orders".* FROM "orders" WHERE "orders"."end_user_id" = ?  [["end_user_id", 3]]