app/controllers/orders_controller.rb

  def index
    @order = Order.find(current_end_user)
---
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]