app/controllers/sell_cds_controller.rb

  def show
    @genres = Genre.all
    @sell_cd = SellCd.find(params[:id])
    @discs = @sell_cd.discs.order(number: "ASC")
---
SELECT  "sell_cds".* FROM "sell_cds" WHERE "sell_cds"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "discs".* FROM "discs" WHERE "discs"."sell_cd_id" = ? ORDER BY "discs"."number" ASC  [["sell_cd_id", 1]]

  def genreidsearch
  	@sell_cds = SellCd.where(genre_id: params[:genre_id]).page(params[:page]).per(PER)
---
SELECT  "sell_cds".* FROM "sell_cds" WHERE "sell_cds"."genre_id" = ? LIMIT ?  [["genre_id", 1], ["LIMIT", 11]]