app/controllers/tops_controller.rb

SELECT  "sell_cds".* FROM "sell_cds" WHERE "sell_cds"."sell_status" = ? ORDER BY "created_time" ASC LIMIT ?  [["sell_status", 1], ["LIMIT", 5]]
---
  def top
    @new = SellCd.order(:created_time)
    @arrivals = @new.where(sell_status: 1).limit(5)