app/models/artist.rb

    def self.getartistid
		artists = self.all
		i = 0
		artistid = Array.new(artists.size)
		artists.each do|artist|
---
SELECT "artists".* FROM "artists"
SELECT COUNT(*) FROM "artists"