app/models/genre.rb

    def self.getgenreid
		genres = self.all
		i = 0
		genreid = Array.new(genres.size)
		genres.each do|genre|
---
SELECT "genres".* FROM "genres"
SELECT COUNT(*) FROM "genres"