app/models/label.rb

    def self.getlabelid
		labels = self.all
		i = 0
		labelid = Array.new(labels.size)
		labels.each do|label|
---
SELECT COUNT(*) FROM "labels"
SELECT "labels".* FROM "labels"