app/views/admins/orders/index.html.erb

        <% total_quantity=0 %>
          <% order.order_contents.each do |order_content| %>
---
SELECT "orders".* FROM "orders"
SELECT "order_contents".* FROM "order_contents" WHERE "order_contents"."order_id" = ?  [["order_id", 1]]

      </tr>
      <% order.order_contents.each do |order_content| %>
        <tr>
            <%sell_cd = SellCd.find_by(id: order_content.sell_cd_id)%>
---
SELECT "order_contents".* FROM "order_contents" WHERE "order_contents"."order_id" = ?  [["order_id", 1]]
SELECT  "sell_cds".* FROM "sell_cds" WHERE "sell_cds"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]